# GetSegmentById Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalModelData..::..GetSegmentById Method
MEPAnalyticalModelData Class See Also
---
Gets the analytical segment with the specified id.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public MEPAnalyticalSegment GetSegmentById(
	int segmentId
)
```

Visual Basic
---
```text
Public Function GetSegmentById ( _
	segmentId As Integer _
) As MEPAnalyticalSegment
```

Visual C++
---
```text
public:
MEPAnalyticalSegment^ GetSegmentById(
	int segmentId
)
```

# ### Parameters
segmentId
    Type: System..::..Int32 The segment id to be retrieved. This id is not 0 based.
# ### Return Value
The returned analytical segment.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The input must be a valid segment id. |

# See Also
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace